tutorials/cases/posterDemo/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistry           off;

chemistryType
{
    solver            ode;
}

solidChemistryType
{
    solver              solidOde;
    method              ODESolidHeterogeneousChemistryModel;
    solidThermoType     const<constRad<constThermo<constRho>>>;
}

initialChemicalTimeStep 1e-10;

turbulentReaction   off;
solidReactionEnergyFromEnthalpy false;
stoichiometricReactions false;
showRelativeReactionRates false;
solidChemistryTimeStepControl false;

diffusionLimitedReactions true;

odeCoeffs
{
    solver      seulex;
}

solidOdeCoeffs
{
    solver      RKCK45;
    absTol      1e-8;
    relTol      1e-6;
}

// Gas-phase species list (N2 + targas) with empty homogeneous reactions.
#include "reactions"

// Single lumped wood-pyrolysis reaction for the poster DEM-coupling demo.
//
// wood → 0.30 char + 0.70 targas   (mass fractions)
//
// The 30 % char yield matches the poster visual: spheres shrink to a char
// core of ~half-diameter (volume ~1/8 ≈ mass ~30 % at constant density).
// The 70 % targas is a single lumped gas species replacing the full
// multi-species tar/CO/CO2/H2/H2O/CH4 set from updraftDemo.
//
// Kinetics: Ta=8000 K fires at 600-800 K, ΔH=−75 kJ/kg exothermic.
// Coefficient tuple: (A  Ta  Tcrit  deltaH  n)
//   A      pre-exponential factor          [1/s]
//   Ta     activation temperature E/R      [K]
//   Tcrit  no reaction below this T        [K]
//   deltaH heat of reaction (>0 endothermic) [J/kg]
//   n      reaction order in the solid
solidReactions
(
    irreversibleSolidArrheniusHeterogeneousReaction
    1.0 wood = 0.30 char + 0.70 targas
    (2.0e5 8000 300 -7.5e4 1)
);

// ************************************************************************* //
