tutorials/cases/posterDemo/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Tiny vertical column for the poster DEM-coupling demo. Genuinely 3D so the
// YADE particles have real cells to be located in. Gravity acts along -z; hot
// gas enters the bottom (inlet) and leaves the top (outlet). Kept deliberately
// small (128 cells) so the coupled YADE+OpenFOAM run finishes quickly.

scale 1;

// Cross-section 0.04 x 0.04 m, height 0.24 m.
xMin  0;
xMax  0.04;
yMin  0;
yMax  0.04;
zMin  0;
zMax  0.24;

vertices
(
    (0    0    0   )   // 0
    (0.04 0    0   )   // 1
    (0.04 0.04 0   )   // 2
    (0    0.04 0   )   // 3
    (0    0    0.24)   // 4
    (0.04 0    0.24)   // 5
    (0.04 0.04 0.24)   // 6
    (0    0.04 0.24)   // 7
);

// 4 x 4 cells across, 8 cells tall -> 128 cells.
// dx = dy = 0.01 m, dz = 0.03 m.
blocks
(
    hex (0 1 2 3 4 5 6 7) (4 4 8) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)   // y = yMin
            (2 3 7 6)   // y = yMax
            (1 2 6 5)   // x = xMax
            (3 0 4 7)   // x = xMin
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
